import { categorySlugs, productSlugs } from "../lib/constants"

export type Product = {
	id: number
	name: string
	slug?: string
	shortDescription?: string
	fullDescription?: string
	images: string[]
	children: ProductChild[]
}

export type ProductChild = {
	id: number
	name: string
	loco: string | string[]
	decimalCode: string
}

export type ProductCategory = {
	title: string
	slug: string
	description?: string
	products: Product[]
}

export const productCategories: ProductCategory[] = [
	{
		title: "Электрооборудование для подвижного состава",
		slug: categorySlugs.electricalEquipment,
		products: [
			{
				id: 1,
				name: "Аппаратные камеры",
				slug: productSlugs.apparatnyeKamery,
				shortDescription:
					"Шкафы каркасного типа для обеспечения коммутации силового и вспомогательного оборудования тепловоза.",
				fullDescription:
					"Аппаратные и высоковольтные камеры — каркасные шкафы, обеспечивающие коммутацию и размещение оборудования тепловоза.",
				images: Array.from(
					{ length: 3 },
					(_, i) => `/products/${categorySlugs.electricalEquipment}/${productSlugs.apparatnyeKamery}/${i + 1}.png`
				),
				children: [
					{ id: 1, name: "Аппаратная камера", loco: "2ТЭ25АМ с MTU", decimalCode: "РАУП.667528.003" },
					{ id: 2, name: "Аппаратная камера", loco: "2(3)ТЭ25К2М", decimalCode: "РАУП.667528.012" },
					{ id: 3, name: "Аппаратная камера", loco: "2(3)ТЭ25К2М", decimalCode: "РАУП.667528.012-01" },
					{ id: 4, name: "Аппаратная камера", loco: "3ТЭ25КМ", decimalCode: "РАУП.667528.005-01" },
					{ id: 5, name: "Аппаратная камера", loco: "3ТЭ28", decimalCode: "РАУП.667528.041" },
					{ id: 6, name: "Аппаратная камера", loco: "2ТЭ25АМ с ХГУ", decimalCode: "РАУП.667528.004" },
					{ id: 7, name: "Аппаратная камера", loco: "2ТЭ25КМ", decimalCode: "РАУП.667528.005" },
					{ id: 8, name: "Аппаратная камера", loco: "2ТЭ25А", decimalCode: "ПРИФ.667528.006" },
					{ id: 9, name: "Аппаратная камера", loco: "2ТЭ25КМ", decimalCode: "РАУП.667528.005-02" },
					{ id: 10, name: "Аппаратная камера тепловоза", loco: "2(3)ТЭ25К2М", decimalCode: "РАУП.667528.023" },
					{ id: 11, name: "Блок", loco: "3(4)ЭС5К", decimalCode: "16ТС.369.867(-01)" },
					{ id: 12, name: "Блок", loco: "3(4)ЭС5К", decimalCode: "16ТС.369.857(-01)" },
					{ id: 13, name: "Блок", loco: "2(3)(4)ЭС5К", decimalCode: "16ТС.369.856(-01)" },
					{ id: 14, name: "Блок силовых аппаратов", loco: "2(3)(4)ЭС5К", decimalCode: "6ТС.369.850" },
					{ id: 15, name: "Высоковольтная аппаратная камера в сборе", loco: "ТЭМ14", decimalCode: "018.70.41.000" },
					{ id: 16, name: "Камера аппаратная", loco: "ТЭМ18ДМ", decimalCode: "РАУП.667528.026" },
					{ id: 17, name: "Камера аппаратная", loco: "3ТЭ25К3М", decimalCode: "2ТЭ25КМ.270.16.000" },
					{ id: 18, name: "Камера высоковольтная", loco: "ТЭМ18В", decimalCode: "ТЭМ18В.70.40.000" },
					{ id: 19, name: "Камера высоковольтная", loco: "ТЭМ18ДМ", decimalCode: "ТЭМ18ДМ.070.16.000" },
					{ id: 20, name: "Камера высоковольтная", loco: "ГТ1h", decimalCode: "ГТ1h.20.100.000" },
					{ id: 21, name: "Камера высоковольтная", loco: "ГТ1h", decimalCode: "ГТ1h.60.100.000" },
					{ id: 22, name: "Модуль аппаратный тепловоза", loco: "ТЭМ28", decimalCode: "РАУП.667528.008" },
				],
			},
			{
				id: 2,
				name: "Блок центрального управления (БЦУ)",
				slug: "bcu",
				shortDescription: "Обеспечивает работу систем управления и диагностики локомотивов различных серий.",
				fullDescription:
					"БЦУ — это основной вычислительный блок, который обрабатывает сигналы от различных подсистем локомотива, обеспечивает диагностику и управление в режиме реального времени.",
				images: [`/products/${categorySlugs.electricalEquipment}/bcu/1.png`],
				children: [
					{
						id: 1,
						name: "Блок центрального управления",
						loco: ["2(3)ТЭ28", "2ТЭ25К2М"],
						decimalCode: "3ТЭ25К2М.070.60.000-01",
					},
					{
						id: 2,
						name: "Блок центрального управления",
						loco: "2ТЭ25К2М",
						decimalCode: "3ТЭ25К2М.070.60.000-01",
					},
				],
			},
			{
				id: 3,
				name: "Блоки аварийного возбуждения",
				slug: "emergency-excitation-blocks",
				shortDescription: "Предназначены для управления обмоткой возбуждения генератора в аварийном режиме.",
				fullDescription:
					"Блоки аварийного возбуждения предназначены для управления обмоткой возбуждения генератора в аварийном режиме, при неработающей системе УСТА.\n\nБлок аварийного возбуждения для тепловоза ТЭМ18ДМ.",
				images: [`/products/${categorySlugs.electricalEquipment}/emergency-excitation-blocks/1.png`],
				children: [
					{
						id: 1,
						name: "Блок аварийного возбуждения тягового генератора",
						decimalCode: "27.Т.144.00.00.000",
						loco: ["ТЭМ18В", "ТЭМ18ДМ"],
					},
				],
			},
			{
				id: 4,
				name: "Блоки интерфейсов",
				slug: "interface-blocks",
				shortDescription:
					"Выполняют функции гальванической или оптической развязки и ретрансляции сигналов различных интерфейсов.",
				fullDescription:
					"В линиях внутренней тепловозной связи блок интерфейсов выполняет функции гальванической развязки и ретрансляции сигналов интерфейсов RS-232 и RS-422, которые используются в дуплексном режиме, в сигналы двухпроводных дуплексных линий связи RS-232.\n\nВ линиях межтепловозной связи блок интерфейсов выполняет функции оптической развязки и ретрансляции сигналов интерфейса RS-422, который используется в дуплексном режиме, в сигналы четырехпроводной дуплексной линий связи RS-422.",
				images: [`/products/${categorySlugs.electricalEquipment}/interface-blocks/1.png`],
				children: [
					{ id: 1, name: "Блок интерфейсов RTP/232-OP.6K", decimalCode: "ПРИФ.667561.001", loco: ["2ТЭ10МК"] },
					{ id: 2, name: "Блок интерфейсов RTP/232-ОР.1К", decimalCode: "ПРИФ.667561.003", loco: ["3ТЭ10МК"] },
					{ id: 3, name: "Блок интерфейсов RTP/422-OP.6K", decimalCode: "ПРИФ.667561.004-01", loco: ["3ТЭ10МК"] },
					{
						id: 4,
						name: "Блок интерфейсов RTP/422-ОР.6К",
						decimalCode: "ПРИФ.667561.004",
						loco: ["2ТЭ10МК", "2ТЭ116К", "ТЭМ18В", "ТЭМ18ДМ"],
					},
					{ id: 5, name: "Блок интерфейсов RTP/485-ОР.1К", decimalCode: "ПРИФ.667561.002", loco: ["3ТЭ10МК"] },
				],
			},
			{
				id: 5,
				name: "Блоки диодов",
				slug: "diode-blocks",
				shortDescription:
					"Предназначен для использования на подвижном составе железнодорожного транспорта в цепях защиты оборудования.",
				fullDescription:
					"Блок диодов предназначен для использования на подвижном составе железнодорожного транспорта в цепях защиты оборудования тепловозов. Блок диодов выполняет функцию развязки защитных цепей силовой установки.\n\nБлок диодов трехфазный предназначен для преобразования трехфазного переменного напряжения в постоянное напряжение на подвижном составе железнодорожного транспорта.",
				images: [`/products/${categorySlugs.electricalEquipment}/diode-blocks/1.png`],
				children: [
					{ id: 1, name: "Блок диодов", decimalCode: "РАУП.432122.001-01", loco: ["2ТЭ25А", "2ТЭ25КМ", "3ТЭ25К2М"] },
					{ id: 2, name: "Блок диодов", decimalCode: "РАУП.432122.001", loco: ["2ТЭ25А", "2ТЭ25КМ", "3ТЭ25К2М"] },
					{
						id: 3,
						name: "Блок диодов трехфазный (БДТ)",
						decimalCode: "РАУП.432122.002",
						loco: ["2(3)ТЭ28", "2ТЭ25А", "3ТЭ25К2М"],
					},
				],
			},
			{
				id: 6,
				name: "Блоки питания",
				slug: "power-supplies",
				shortDescription: "Предназначены для преобразования питания бортовой сети.",
				fullDescription:
					"Блок питания БППЧ-2 предназначен для преобразования питания бортовой сети 110В в питание управляемого выпрямителя возбуждения (24В).\n\nБлок питания БППЧ-2 для тепловозов 2ТЭ25А, 2ТЭ25АМ.",
				images: [`/products/${categorySlugs.electricalEquipment}/power-supplies/1.png`],
				children: [
					{
						id: 1,
						name: "Блок питания БППЧ-2",
						decimalCode: "27.Т.261.00.00.000",
						loco: ["2ТЭ25А", "2ТЭ25АМ с MTU", "2ТЭ25АМ с ХГУ"],
					},
				],
			},
			{
				id: 7,
				name: "Выпрямители",
				slug: "rectifiers",
				shortDescription: "Представляют собой трехканальные преобразователи переменного тока сети 50 Гц в постоянный.",
				fullDescription:
					"Выпрямитель В-ОПЕ предназначен для преобразования однофазного переменного напряжения с выхода синхронного возбудителя тепловоза в постоянные напряжения:\n- Для питания обмоток возбуждения тягового генератора\n- Для питания бортовой сети тепловоза\n- Для заряда аккумуляторной батареи\n\nВыпрямитель В-ОПЕ для тепловоза ТЭМ18ДМ.",
				images: [`/products/${categorySlugs.electricalEquipment}/rectifiers/1.png`],
				children: [
					{
						id: 1,
						name: "Выпрямитель В-ОПЕ-150/200-75-УЗ",
						decimalCode: "27.Т.119.01.00.000-5",
						loco: ["ТЭМ18В", "ТЭМ18ДМ"],
					},
				],
			},
			{
				id: 8,
				name: "Измерители температурные",
				slug: "temperature-measurers",
				shortDescription:
					"Предназначены для обработки сигналов с термосопротивлений и термопар и выдачи информации на дисплейный модуль GERSYS.",
				fullDescription:
					"Предназначен для приема и обработки сигналов с термосопротивлений типа ТСМ и термопар ТХА и выдачи информации об измеренных температурах на дисплейный модуль GERSYS. Измеритель температурный обеспечивает прием сигналов от ТСМ по 24 каналам и от ТХА по 24 каналам.",
				images: [`/products/${categorySlugs.electricalEquipment}/temperature-measurers/1.png`],

				children: [
					{
						id: 1,
						name: "Измеритель температурный",
						decimalCode: "27.Т.158.22.00.000-04",
						loco: ["2ТЭ25АМ с MTU", "2ТЭ25АМ с ХГУ", "2ТЭ25К", "2ТЭ25КМ", "ТЭМ18ДМ"],
					},
					{
						id: 2,
						name: "Измеритель температурный",
						decimalCode: "ПРИФ.405524.001",
						loco: ["2ТЭ10МК", "2ТЭ116К", "3ТЭ10МК"],
					},
				],
			},
			{
				id: 9,
				name: "Конвертер сигналов",
				slug: "signal-converters",
				shortDescription: "Используется в системах управления и регулирования электрической передачи тепловозов.",
				fullDescription:
					"Преобразователь (конвертер) сигналов используется в системах управления и регулирования электрической передачи тепловозов. Предназначен для гальванического разделения и преобразования первичного сигнала напряжения в пропорциональный токовый сигнал.",
				images: [`/products/${categorySlugs.electricalEquipment}/signal-converters/1.png`],

				children: [
					{
						id: 1,
						name: "Конвертер сигналов",
						decimalCode: "РАУП.674511.001(-01)",
						loco: ["2(3)ТЭ25К2М", "2(3)ТЭ28", "ТЭМ18ДМ"],
					},
				],
			},
			{
				id: 10,
				name: "Контроллеры машиниста (задатчики)",
				slug: "driver-controllers",
				shortDescription:
					"Контроллеры машиниста (задатчики) задают по команде машиниста режимы работы силового оборудования.",
				fullDescription:
					"Предназначены для применения на магистральных и маневровых тепловозах и поездах метро. Обеспечивают управление скоростью и направлением движения подвижного состава.",
				images: [`/products/${categorySlugs.electricalEquipment}/driver-controllers/1.png`],

				children: [
					{
						id: 1,
						name: "Задатчик",
						decimalCode: "ПРИФ.648152.008",
						loco: ["ТЭМ18В", "ТЭМ18Д", "ТЭМ18ДМ", "ТЭМ2К", "ЧМЭ3К"],
					},
					{
						id: 2,
						name: "Задатчик",
						decimalCode: "ПРИФ.648152.010",
						loco: ["2ТЭ10МК", "2ТЭ116К", "3ТЭ10МК"],
					},
					{
						id: 3,
						name: "Контроллер машиниста",
						decimalCode: "РАУП.647642.001-01",
						loco: ["2(3)ТЭ25К2М", "2(3)ТЭ25К3М", "2(3)ТЭ28", "2ТЭ25КМ", "3ТЭ25КМ"],
					},
					{
						id: 4,
						name: "Контроллер машиниста",
						decimalCode: "РАУП.647642.008-02",
						loco: ["Москва 2024"],
					},
					{
						id: 5,
						name: "Контроллер машиниста",
						decimalCode: "РАУП.647642.010",
						loco: ["Балтиец"],
					},
					{
						id: 6,
						name: "Контроллер машиниста",
						decimalCode: "РАУП.647642.006",
						loco: ["РА-3"],
					},
				],
			},
			{
				id: 11,
				name: "Контроллеры машиниста (резервные)",
				slug: "driver-controllers-reserve",
				shortDescription:
					"Обеспечивают управление исполнительными устройствами в случае отказа контроллера машиниста и (или) блока БЭЛ.",
				fullDescription:
					"Обеспечивают управление основными исполнительными устройствами тепловоза, необходимыми для приведения его в движение, в случае отказа контроллера машиниста и (или) блока БЭЛ.",
				images: [`/products/${categorySlugs.electricalEquipment}/driver-controllers-reserve/1.png`],

				children: [
					{
						id: 1,
						name: "Контроллер машиниста резервный",
						decimalCode: "ПРИФ.648152.004-01",
						loco: ["ТЭМ18В", "ТЭМ18Д", "ТЭМ18ДМ", "ТЭМ2К"],
					},
					{
						id: 2,
						name: "Контроллер машиниста резервный",
						decimalCode: "ПРИФ.648152.004",
						loco: ["2ТЭ10МК", "3ТЭ10МК"],
					},
					{
						id: 3,
						name: "Контроллер машиниста резервный",
						decimalCode: "ПРИФ.648152.004-02",
						loco: ["ЧМЭ3К"],
					},
				],
			},
			{
				id: 12,
				name: "Преобразователи",
				slug: "converters",
				shortDescription:
					"Предназначены для преобразования нестабильного по величине и частоте трехфазного переменного напряжения.",
				fullDescription:
					"Преобразователь тяговый на IGBT транзисторах и преобразователь пусковой дизель-генератора применяются для управления тяговыми двигателями и возбуждением генераторов тепловозов.",
				images: [`/products/${categorySlugs.electricalEquipment}/converters/1.png`],

				children: [
					{
						id: 1,
						name: "Преобразователь пусковой дизель-генератора",
						decimalCode: "27.Т.755.00.00.000",
						loco: ["2(3)ТЭ28"],
					},
					{
						id: 2,
						name: "Преобразователь тяговый на IGBT транзисторах",
						decimalCode: "27.Т.176.01.00.000.2",
						loco: ["2ТЭ25А"],
					},
				],
			},
			{
				id: 13,
				name: "Пульты управления",
				slug: "control-panels",
				shortDescription:
					"Пульты управления режимами работы оборудования тепловоза и контроля состояния основных и вспомогательных систем.",
				fullDescription:
					"Пульты управления предназначены для управления режимами работы оборудования тепловоза и контроля состояния основных и вспомогательных систем. Обеспечивают комфортную работу бригад машинистов благодаря продуманной эргономике рабочего места.",
				images: [`/products/${categorySlugs.electricalEquipment}/control-panels/1.png`],

				children: [
					{
						id: 1,
						name: "Комплект пультов управления унифицированных (УПУ)",
						decimalCode: "27.Т.258.00.00.000-03",
						loco: ["ТЭМ18ДМ"],
					},
					{
						id: 2,
						name: "Комплект пультов управления унифицированных (УПУ)",
						decimalCode: "27.Т.258.00.00.000-04",
						loco: ["ТЭМ18В"],
					},
					{
						id: 3,
						name: "Комплект пультов управления унифицированных (УПУ)",
						decimalCode: "27.Т.258.00.00.000-06",
						loco: ["ТЭМ19"],
					},
					{ id: 4, name: "Комплект пультового оборудования", decimalCode: "РАУП.667527.010", loco: ["ТЭМ23"] },
					{
						id: 5,
						name: "Комплект пультового оборудования машиниста",
						decimalCode: "РАУП.668411.001",
						loco: ["ТЭМ28"],
					},
					{ id: 6, name: "Панель приборная", decimalCode: "2ТЭ25К2М.170.17.000", loco: ["3ТЭ25К2М", "3ТЭ28"] },
					{ id: 7, name: "Панель управления средней секции", decimalCode: "РАУП.667528.006", loco: ["3ТЭ25К2М"] },
					{ id: 8, name: "Пульт управления", decimalCode: "РАУП.667528.013", loco: ["ТГ16М"] },
					{ id: 9, name: "Пульт управления", decimalCode: "2ТЭ25К2М.070.17.000", loco: ["3ТЭ25К2М"] },
					{ id: 10, name: "Пульт управления тепловоза", decimalCode: "РАУП.667528.002", loco: ["ТГ16М"] },
					{ id: 11, name: "Пульт управления тепловоза", decimalCode: "РАУП.667528.009", loco: ["2(3)ТЭ25К2М"] },
					{
						id: 12,
						name: "Пульт управления унифицированный (УПУ)",
						decimalCode: "27.Т.257.00.00.000-07",
						loco: ["2ТЭ25КМ"],
					},
					{
						id: 13,
						name: "Пульт управления унифицированный (УПУ)",
						decimalCode: "27.Т.257.00.00.000-09",
						loco: ["2ТЭ25К"],
					},
					{
						id: 14,
						name: "Пульт управления унифицированный (УПУ)",
						decimalCode: "27.Т.257.00.00.000-04",
						loco: ["2ТЭ116К"],
					},
					{
						id: 15,
						name: "Пульт управления унифицированный (УПУ)",
						decimalCode: "27.Т.257.00.00.000-05",
						loco: ["2ТЭ10МК"],
					},
					{
						id: 16,
						name: "Пульт управления унифицированный (УПУ)",
						decimalCode: "27.Т.257.00.00.000-10",
						loco: ["2ТЭ25А", "2ТЭ25АМ с MTU", "2ТЭ25АМ с ХГУ"],
					},
					{
						id: 17,
						name: "Пульт управления унифицированный (УПУ)",
						decimalCode: "27.Т.257.00.00.000-06",
						loco: ["3ТЭ10МК"],
					},
					{
						id: 18,
						name: "Установка пультового оборудования",
						decimalCode: "ЗАОМ.0250.06.00.00.000-01",
						loco: ["ТЭМ10"],
					},
				],
			},
			{
				id: 14,
				name: "Электронные блоки БЭЛ",
				slug: "bel-blocks",
				shortDescription:
					"Электронные блоки БЭЛ предназначены для бесконтактного управления электрической схемой локомотива.",
				fullDescription:
					"Блоки БЭЛ содержат ячейку управления и три ячейки ключей. Обеспечивают коммутацию и информационный обмен в электрической схеме тепловоза. Универсальны для разных локомотивов с задатчиком позиций.",
				images: [`/products/${categorySlugs.electricalEquipment}/bel-blocks/1.png`],

				children: [
					{
						id: 1,
						name: "Блок электронный БЭЛ",
						decimalCode: "ПРИФ.667565.001",
						loco: ["2ТЭ10МК", "2ТЭ116К", "3ТЭ10МК"],
					},
					{ id: 2, name: "Блок электронный БЭЛ", decimalCode: "ПРИФ.667565.001-03", loco: ["ТЭМ18В"] },
					{ id: 3, name: "Блок электронный БЭЛ", decimalCode: "ПРИФ.667565.001-02", loco: ["ЧМЭ3К"] },
					{
						id: 4,
						name: "Блок электронный БЭЛ",
						decimalCode: "ПРИФ.667565.001-01",
						loco: ["ТЭМ18Д", "ТЭМ18ДМ", "ТЭМ2К"],
					},
				],
			},
			{
				id: 15,
				name: "Устройства обработки информации",
				slug: "data-processing-devices",
				shortDescription: "Основные устройства микропроцессорной системы управления и диагностики (МПСУ).",
				fullDescription:
					"Предназначены для реализации алгоритмов управления и диагностики оборудования. Позволяют эффективно распределять мощность и избегать неэкономичных режимов.",
				images: [`/products/${categorySlugs.electricalEquipment}/data-processing-devices/1.png`],

				children: [
					{ id: 1, name: "Устройство обработки информации", decimalCode: "27.Т.276.01.00.000.2-02", loco: ["2ТЭ25К"] },
				],
			},
			{
				id: 16,
				name: "Шкафы с автоматическими выключателями",
				slug: "circuit-breaker-cabinets",
				shortDescription: "Устройства автоматической защиты систем тепловозов, выполненные в отдельном корпусе.",
				fullDescription:
					"Конструкция закрытого типа для размещения аппаратуры защиты и коммутации электрических цепей тепловоза.",
				images: [`/products/${categorySlugs.electricalEquipment}/circuit-breaker-cabinets/1.png`],

				children: [
					{ id: 1, name: "Шкаф автоматов", decimalCode: "ГТ1.60.300.000", loco: ["ГТ1h"] },
					{ id: 2, name: "Шкаф автоматов", decimalCode: "ГТ1.20.300.000", loco: ["ГТ1h"] },
					{ id: 3, name: "Шкаф автоматов МТО", decimalCode: "РАУП.667518.008", loco: ["ТЭМ28"] },
					{ id: 4, name: "Шкаф аппаратов ДГУ", decimalCode: "РАУП.667518.007", loco: ["ТЭМ28"] },
					{ id: 5, name: "Шкаф пуска дизеля (левый)", decimalCode: "РАУП.667518.009", loco: ["2ТЭ25К2М", "3ТЭ25К2М"] },
					{ id: 6, name: "Шкаф пуска дизеля (правый)", decimalCode: "РАУП.667518.010", loco: ["2ТЭ25К2М", "3ТЭ25К2М"] },
					{ id: 7, name: "Шкаф с автоматическими выключателями", decimalCode: "РАУП.667518.001-01", loco: ["2ТЭ25А"] },
					{ id: 8, name: "Шкаф с автоматическими выключателями", decimalCode: "РАУП.667518.001", loco: ["2ТЭ25К"] },
					{
						id: 9,
						name: "Шкаф с автоматическими выключателями и контакторами",
						decimalCode: "РАУП.667518.002",
						loco: ["2ТЭ25АМ с MTU", "2ТЭ25АМ с ХГУ"],
					},
					{
						id: 10,
						name: "Шкаф управления вентиляторами передней тележки (ШУВПТ)",
						decimalCode: "РАУП.667518.011",
						loco: ["2ТЭ25К2М", "3ТЭ25К2М"],
					},
				],
			},
		],
	},
	{
		title: "Интерьеры рельсового транспорта",
		slug: categorySlugs.interiors,
		products: [],
	},
	{
		title: "Электротехнические шины и токоотвод",
		slug: categorySlugs.busbars,
		products: [],
	},
	{
		title: "Телекоммуникационные стойки и шкафы",
		slug: categorySlugs.telecomСabinets,
		products: [],
	},
	{
		title: "Продажа неликвидов",
		slug: categorySlugs.surplusSale,
		products: [],
	},
]
