type Project = {
	title: string
	description: string
	details: {
		label: string
		value: string
	}[]
}

export const projects: Project[] = [
	{
		title: "Новая Москва 768",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Фили",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Москва 360",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Ташкент",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Баку",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "София",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Москва 2020",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Пассажирские вагоны серии 61-4516",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
	{
		title: "Пассажирские вагоны серии 61-4517",
		description:
			"Достаточно подробное описание проекта с учётом самой важной информации о нём, необходимой потенциальному клиенту, в две или три строки.",
		details: [
			{ label: "Год сдачи", value: "2022" },
			{ label: "Размер партии", value: "150 единиц" },
			{ label: "Тип поезда", value: "Метро" },
		],
	},
]
