export const menuItems = [
	{
		key: "products",
		label: "Продукция",
		links: [
			"Электрооборудование для подвижного состава",
			"Интерьеры рельсового транспорта",
			"Электротехнические шины и токоотвод",
			"Телекоммуникационные стойки и шкафы",
			"Продажа неликвидов",
		],
	},
	{
		key: "company",
		label: "Компания",
		links: [
			"История",
			"Вакансии",
			"Производство",
			"Миссия",
			"Бережливое произ-во",
			"Сот-во с уч. заведениями",
			"Новости предприятия",
			"Новости",
		],
	},
	{
		key: "services",
		label: "Услуги",
		links: ["Контрактное производство", "Гарантийное обслуживание", "Ремонт оборудования"],
	},
]
